In [1]:
import pandas
pandas.__version__

'1.0.1'

In [42]:
import numpy as np
import pandas as pd

In [43]:

counts=pd.Series([500,600,700,800,900,1000])
counts

0     500
1     600
2     700
3     800
4     900
5    1000
dtype: int64

In [44]:
counts.values

array([ 500,  600,  700,  800,  900, 1000], dtype=int64)

In [45]:
counts.index

RangeIndex(start=0, stop=6, step=1)

In [46]:
Fruits =pd.Series([100,200,300,400,500],
index =['Mango' ,'Banana','Pomegranat','Grapes','Apple'])
Fruits

Mango         100
Banana        200
Pomegranat    300
Grapes        400
Apple         500
dtype: int64

In [47]:
Fruits['Mango']

100

In [48]:
Fruits[4]

500

In [49]:
Fruits.counts='counts'
Fruits.index.name='Fruit names'
Fruits

Fruit names
Mango         100
Banana        200
Pomegranat    300
Grapes        400
Apple         500
dtype: int64

In [50]:
np.log(Fruits)

Fruit names
Mango         4.605170
Banana        5.298317
Pomegranat    5.703782
Grapes        5.991465
Apple         6.214608
dtype: float64

In [51]:
Fruits[Fruits>300]

Fruit names
Grapes    400
Apple     500
dtype: int64

In [52]:
Fruits[Fruits<=500]

Fruit names
Mango         100
Banana        200
Pomegranat    300
Grapes        400
Apple         500
dtype: int64

In [53]:
Fruits[Fruits<500]

Fruit names
Mango         100
Banana        200
Pomegranat    300
Grapes        400
dtype: int64

In [54]:
bacteria_dict = {'Mango': 100, 'Banana': 200, 'Pomegranate': 300, 'Apple': 400}
print(bacteria_dict)
pd.Series(bacteria_dict)

{'Mango': 100, 'Banana': 200, 'Pomegranate': 300, 'Apple': 400}

Mango          100
Banana         200
Pomegranate    300
Apple          400
dtype: int64

In [126]:
student = {"name":["A","B","C","D"],
            "year":[2000,2001,2002,2003],
            "per":[85,90,91,92]}
print(student)
student = pd.DataFrame(student)
student

{'name': ['A', 'B', 'C', 'D'], 'year': [2000, 2001, 2002, 2003], 'per': [85, 90, 91, 92]}

  name  year  per
0    A  2000   85
1    B  2001   90
2    C  2002   91
3    D  2003   92

In [127]:

df = pd.DataFrame(student, columns=["year", "name" ,"per"])
df

   year name  per
0  2000    A   85
1  2001    B   90
2  2002    C   91
3  2003    D   92

In [128]:
df['nonsense'] = df.year / df.per
df

   year name  per   nonsense
0  2000    A   85  23.529412
1  2001    B   90  22.233333
2  2002    C   91  22.000000
3  2003    D   92  21.771739

In [129]:
df['Series aligned'] = pd.Series(range(4),index=[0,1,2,3])
df

   year name  per   nonsense  Series aligned
0  2000    A   85  23.529412               0
1  2001    B   90  22.233333               1
2  2002    C   91  22.000000               2
3  2003    D   92  21.771739               3

In [130]:
df.to_dict()

{'year': {0: 2000, 1: 2001, 2: 2002, 3: 2003},
 'name': {0: 'A', 1: 'B', 2: 'C', 3: 'D'},
 'per': {0: 85, 1: 90, 2: 91, 3: 92},
 'nonsense': {0: 23.529411764705884,
  1: 22.233333333333334,
  2: 22.0,
  3: 21.77173913043478},
 'Series aligned': {0: 0, 1: 1, 2: 2, 3: 3}}

In [116]:
pd.DataFrame(df.to_dict())

   year name  per   nonsense  Series aligned
0  2000    A   85  23.529412               0
1  2001    B   90  22.233333               1
2  2002    C   91  22.000000               2
3  2003    D   92  21.771739               3

In [88]:
data = [{'a': i ,'b':20*i} for i in range(10)]
print(data)
pd.DataFrame(data)

[{'a': 0, 'b': 0}, {'a': 1, 'b': 20}, {'a': 2, 'b': 40}, {'a': 3, 'b': 60}, {'a': 4, 'b': 80}, {'a': 5, 'b': 100}, {'a': 6, 'b': 120}, {'a': 7, 'b': 140}, {'a': 8, 'b': 160}, {'a': 9, 'b': 180}]

   a    b
0  0    0
1  1   20
2  2   40
3  3   60
4  4   80
5  5  100
6  6  120
7  7  140
8  8  160
9  9  180

In [89]:
pd.DataFrame([{'aa':1, 'bb':2}, {'cc':3, 'dd':4}])

    aa   bb   cc   dd
0  1.0  2.0  NaN  NaN
1  NaN  NaN  3.0  4.0

In [90]:
df = pd.DataFrame([{'aa':1, 'bb':2}, {'cc':3, 'dd':4}])
df = df.to_dict()
df

{'aa': {0: 1.0, 1: nan},
 'bb': {0: 2.0, 1: nan},
 'cc': {0: nan, 1: 3.0},
 'dd': {0: nan, 1: 4.0}}

In [91]:
pd.DataFrame(np.random.randint(1,10),
            columns=['C1','C2'] ,
             index=['a', 'b', 'c'])

   C1  C2
a   4   4
b   4   4
c   4   4

In [92]:
ind = pd.Index([1,2,3,4,5,6,7,8,10])
ind

Int64Index([1, 2, 3, 4, 5, 6, 7, 8, 10], dtype='int64')

In [93]:
ind[1]

2

In [94]:
ind[:]

Int64Index([1, 2, 3, 4, 5, 6, 7, 8, 10], dtype='int64')

In [95]:
ind[1:8:2]

Int64Index([2, 4, 6, 8], dtype='int64')

In [96]:
ind[1:8]

Int64Index([2, 3, 4, 5, 6, 7, 8], dtype='int64')

In [97]:
print(ind.size, ind.shape, ind.ndim, ind.dtype)

9 (9,) 1 int64

In [98]:


rng = np.random.RandomState(20)
ser = pd.Series(rng.randint(1,18,8))
ser

0     4
1    16
2    10
3    12
4     8
5     3
6     1
7     9
dtype: int32

In [99]:
dfr = pd.DataFrame(rng.randint(1, 18,(5, 5)),
                   columns=['A','B','C','D','E'])
dfr

    A   B  C   D   E
0  17   7  7  17  10
1   6   8  6   3   7
2  14  12  4  11  12
3  14  15  1  11  12
4   7  12  4  14  12

In [100]:
np.exp(ser)

0    5.459815e+01
1    8.886111e+06
2    2.202647e+04
3    1.627548e+05
4    2.980958e+03
5    2.008554e+01
6    2.718282e+00
7    8.103084e+03
dtype: float64

In [101]:
np.sin(dfr*np.pi/4)

          A             B             C         D             E
0  0.707107 -7.071068e-01 -7.071068e-01  0.707107  1.000000e+00
1 -1.000000 -2.449294e-16 -1.000000e+00  0.707107 -7.071068e-01
2 -1.000000  3.673940e-16  1.224647e-16  0.707107  3.673940e-16
3 -1.000000 -7.071068e-01  7.071068e-01  0.707107  3.673940e-16
4 -0.707107  3.673940e-16  1.224647e-16 -1.000000  3.673940e-16

In [102]:
np.cos(dfr*np.pi/4)

              A         B             C             D             E
0  7.071068e-01  0.707107  7.071068e-01  7.071068e-01  3.061617e-16
1 -1.836970e-16  1.000000 -1.836970e-16 -7.071068e-01  7.071068e-01
2 -4.286264e-16 -1.000000 -1.000000e+00 -7.071068e-01 -1.000000e+00
3 -4.286264e-16  0.707107  7.071068e-01 -7.071068e-01 -1.000000e+00
4  7.071068e-01 -1.000000 -1.000000e+00 -4.286264e-16 -1.000000e+00

In [103]:
area = pd.Series({'Arizona':26778, 'Florida':34567, 'Georgia':56781}, name='area')
population = pd.Series({'Texas':45266, 'Utah':54356, 'Florida':65789}, name='population')
print(area)
population

Arizona    26778
Florida    34567
Georgia    56781
Name: area, dtype: int64

Texas      45266
Utah       54356
Florida    65789
Name: population, dtype: int64

In [104]:
population/area

Arizona         NaN
Florida    1.903231
Georgia         NaN
Texas           NaN
Utah            NaN
dtype: float64

In [105]:
area/population

Arizona         NaN
Florida    0.525422
Georgia         NaN
Texas           NaN
Utah            NaN
dtype: float64

In [106]:
area.index | population.index

Index(['Arizona', 'Florida', 'Georgia', 'Texas', 'Utah'], dtype='object')

In [107]:
s = pd.Series([2,4,6,8], index=[0,1,2,3])
a =pd.Series([8,10,12,14], index=[1,2,3,4])
print(s)
print(a)
a
s+a

0    2
1    4
2    6
3    8
dtype: int64
1     8
2    10
3    12
4    14
dtype: int64

0     NaN
1    12.0
2    16.0
3    20.0
4     NaN
dtype: float64

In [108]:
s.add(a,fill_value=0)

0     2.0
1    12.0
2    16.0
3    20.0
4    14.0
dtype: float64

In [109]:
df

{'aa': {0: 1.0, 1: nan},
 'bb': {0: 2.0, 1: nan},
 'cc': {0: nan, 1: 3.0},
 'dd': {0: nan, 1: 4.0}}

In [110]:
df2 = pd.DataFrame({})

In [121]:
df

   year name  per   nonsense  Series aligned
0  2000    A   85  23.529412               0
1  2001    B   90  22.233333               1
2  2002    C   91  22.000000               2
3  2003    D   92  21.771739               3

In [133]:
df2 = pd.DataFrame({"name": ["A", "B", "C"], "Population": ["1000", "2000", "3000"]})
df2

  name Population
0    A       1000
1    B       2000
2    C       3000

In [134]:
df.merge(df2)

   year name  per   nonsense  Series aligned Population
0  2000    A   85  23.529412               0       1000
1  2001    B   90  22.233333               1       2000
2  2002    C   91  22.000000               2       3000

In [135]:
df3 = pd.DataFrame({"name": ["A", "B"], "Population": ["100", "200"]})
df3
df.merge(df3, right_on='name', left_on='name')

   year name  per   nonsense  Series aligned Population
0  2000    A   85  23.529412               0        100
1  2001    B   90  22.233333               1        200

In [136]:
df4 = pd.DataFrame({"name": ["A", "B", "C"], "Population": ["1000", "2000", "500"]})
df.merge(df4, how='outer')

   year name  per   nonsense  Series aligned Population
0  2000    A   85  23.529412               0       1000
1  2001    B   90  22.233333               1       2000
2  2002    C   91  22.000000               2        500
3  2003    D   92  21.771739               3        NaN

In [138]:
df5 = pd.DataFrame({"name": ["A", "B", "C"], "Population": ["1000", "2000", "500"]})
print(df)
df.merge(df5, how='outer')

   year name  per   nonsense  Series aligned
0  2000    A   85  23.529412               0
1  2001    B   90  22.233333               1
2  2002    C   91  22.000000               2
3  2003    D   92  21.771739               3

   year name  per   nonsense  Series aligned Population
0  2000    A   85  23.529412               0       1000
1  2001    B   90  22.233333               1       2000
2  2002    C   91  22.000000               2        500
3  2003    D   92  21.771739               3        NaN

In [143]:
serie_ab = pd.Series([np.nan, 1.5, 2.5, 3.5, 4.5, np.nan],
                     index=['f', 'e', 'd', 'c', 'b', 'a'])
serie_bc = pd.Series(np.arange(len(serie_a), dtype=np.float64),
                 index=['f', 'e', 'd', 'c', 'b', 'a'])

In [144]:
serie_ab

f    NaN
e    1.5
d    2.5
c    3.5
b    4.5
a    NaN
dtype: float64

In [145]:
serie_bc

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [146]:
pd.Series(np.where(pd.isnull(serie_ab), serie_bc, serie_ab), index=serie_a.index)

f    0.0
e    1.5
d    2.5
c    3.5
b    4.5
a    5.0
dtype: float64

In [148]:
serie_ab.combine_first(serie_bc)

f    0.0
e    1.5
d    2.5
c    3.5
b    4.5
a    5.0
dtype: float64